                                                                                                                                                                                                                                                                                                tweets
0   After learning from this product experience, we’re sharing an update: today Retweet functionality will be returning to the way it was before.\n\nHere's what we saw while we prompted Quote Tweets (1/4): https://t.co/MzoDKy3d69                                                                 
1   Our goal with prompting QTs (instead of Retweets) was to encourage more thoughtful amplification. We don’t believe that this happened, in practice. The use of Quote Tweets increased, but 45% of them included single-word affirmations and 70% had less than 25 characters. (2/4)               
2   Some of you may no longer see the “Share in a Fleet” option in the Tweet share menu. To get back to sharing Tweets in your Fleets, update to the latest version of the Twitter for iOS or Android app once it’s available for you.                                                                
3   This appears to be a clever scam attempt from an account with a blue verification badge masquerading as @TwitterSupport. \n\nIt links to a Google site that asks for Twitter log-in info (and password). \n\nThe handle (@satejp) used to be that of an Indian politician. https://t.co/gnh7Nc3V16
4   You mean people didn't behave the way your dev app algorithm nerd brains predicted they would? My stars... https://t.co/1dSOwyKZjg                                                                                                                                                                
5   Every time I post something negative about the Dems, the lib minions at @Twitter remove 100 followers. We know everyone that works at @Twitter is a Democrat, but this censorship of conservative voices is un-American. @jack @TwitterSupport #censorship #freedom                               
6   .@Twittersupport, is there a way to report the spreading of false COVID information like there is for voting? \n\nI tried and maybe I missed it? I’m honestly asking cause I...feel like we need this 😬                                                                                           
7   Iran opposition trolls threatening me with rape &amp; death: I will never stop reporting facts because you don't like it.\n\n@TwitterSupport @omidkordestani Fix your broken Persian support response. Enough.                                                                                    
8   Finally I am able to access my account 24 hours it was hacked. Thank you @TwitterSupport  for your help. Many thanks to @rohanrgupta @t_d_h_nair @tehseenp @shilpakannan  for your support. God bless you all!                                                                                    
9   @jack @Twitter @TwitterSupport \n\nWHERE’s the LINE? https://t.co/CQEGEsuDWY                                                                                                                                                                                                                      
10  @TwitterSupport @Twitter @Jack Please Look into the Account of @JamesEFoster , a Great Left wing activist, targeted by trolls, rigging the Twitter algorithm &amp; Mass reporting Left wing accounts. this is abhorrent &amp; MUST be sorted out Please help! Urgently.                           
11  🌏 \n\n@TwitterSupport could you please have a look again at the suspension of @Fridays_India. They are an important voice for #climateaction and the #FridaysForFuture movement. I hope they can be back on Twitter soon.                                                                         